from aiogram.enums import parse_mode


class Country:
    back_name = None
    name = None
    capital = None
    indday = None
    lang = None
    anthem = None
    area = None
    gov = None
    neighbors = None
    tel_code = None
    religion = None
    population = None
    currency = None
    time_zone = None
    net_domain = None
    about = None
    

uzb = Country()
uzb.back_name = 'Узбекистан'
uzb.name = '🇺🇿 Узбекистан'
uzb.capital = 'Ташкент'
uzb.indday = '1 сентября 1991 года'
uzb.lang = 'узбекский'
uzb.anthem = ('<a href="https://ru.wikipedia.org/wiki/%D0%A4%D0%B0%D0%B9%D0%BB:Uzbekistan_anthem.ogg">O\'zbekiston Respublikasining Davlat Madhiyasi</a>', parse_mode.ParseMode.HTML)
uzb.area = '448 924 км² (56-я в мире)'
uzb.gov = 'президентская республика'
uzb.neighbors = '🇦🇫 Афганистан, 🇰🇿 Казахстан, 🇰🇬 Кыргызстан, 🇹🇯 Таджикистан и 🇹🇲 Туркменистан'
uzb.tel_code = '+998'
uzb.religion = 'Ислам'
uzb.population = '36 000 000 чел.'
uzb.currency = 'узбекский сум (UZS, код 860)'
uzb.time_zone = 'UTC+5:00'
uzb.net_domain = '.uz'
uzb.about = '🇺🇿 Узбекистан – страна в Центральной Азии, которая некогда входила в состав СССР. Она славится своими мечетями, мавзолеями и сооружениями, возведенными на Великом шелковом пути – древней торговой дороге между 🇨🇳 Китаем и Средиземноморьем, а также своими древними городами, такие как Самарканд, Бухара, Хива, Ферганская долина, история которых начинаются от VIII века до н. э.'

ukr = Country()
ukr.back_name = 'Украина'
ukr.name = '🇺🇦 Украина'
ukr.capital = 'Киев'
ukr.indday = '24 августа 1991 года'
ukr.lang = 'украинский'
ukr.anthem = ('<a href="https://ru.wikipedia.org/wiki/%D0%A4%D0%B0%D0%B9%D0%BB:National_anthem_of_Ukraine,_instrumental.oga">Ще не вмерла України і слава, і воля</a>', parse_mode.ParseMode.HTML)
ukr.area = '603 549 км² (44-я в мире)'
ukr.gov = 'парламентско-президентская республика'
ukr.neighbors = '🇧🇾 Беларусь, 🇭🇺 Венгрия, 🇲🇩 Молдова, 🇵🇱 Польша, 🇷🇺 Россия, 🇷🇴 Румыния и 🇸🇰 Словакия'
ukr.tel_code = '+380'
ukr.religion = 'Православие'
ukr.population = '40 997 699 чел.'
ukr.currency = 'украинская гривна (UAH, код 980)'
ukr.time_zone = 'UTC+2:00/+3:00'
ukr.net_domain = '.ua, .укр'
ukr.about = '🇺🇦 Украина – это большая страна в Восточной 🇪🇺 Европе, известная православными церквями, черноморскими курортами и лесистыми горами. В Киеве, столице страны, расположен Софийский собор, украшенный золотыми куполами, мозаикой XI века и фресками. Над рекой Днепр возвышается монастырь Киево-Печерская лавра, место паломничества многих православных христиан'

